//------------------------------------------------------------------------------
//
//      Магистральный пассажирский электровоз переменного тока ЧС4т.
//      Дополнение для Russian Railway Simulator (RRS)
//
//      (c) RRS development team:
//          Дмитрий Притыкин (maisvendoo),
//          Николай Авилкин (avilkin.nick)
//
//      Дата: 16/06/2019
//
//------------------------------------------------------------------------------

#include "km-21kr2.h"

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
Km21KR2::Km21KR2(QObject* parent) : Device(parent)
  , up(false)
  , up1(false)
  , zero(true)
  , down1(false)
  , down(false)
{

}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void Km21KR2::setUpState(bool state)
{
    up = state;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void Km21KR2::setUp1State(bool state)
{
    up1 = state;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void Km21KR2::setDown1State(bool state)
{
    down1 = state;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void Km21KR2::setDownState(bool state)
{
    down = state;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void Km21KR2::ode_system(const state_vector_t& Y, state_vector_t& dYdt, double t)
{

}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void Km21KR2::load_config(CfgReader& cfg)
{

}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void Km21KR2::preStep(state_vector_t& Y, double t)
{

}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void Km21KR2::stepKeysControl(double t, double dt)
{
    setUpState(KEY_Q);
    setUp1State(KEY_A);
    if (getKeyState(KEY_E))
    {
        setDownState(true);
    }
    if (getKeyState(KEY_D))
    {
        if (getKeyState(isControl()))
        {
            setDownState(false);
        }
        else
        {
            setDown1State(true);
        }
    }
    else
    {
        setDown1State(false);
    }

    if (!up || !up1 || !down1 || !down)
    {
        zero = true;
    }
    else
    {
        zero = false;
    }

    double s01 = static_cast<double>(up);
    double s02 = static_cast<double>(up1);
    double s03 = static_cast<double>(zero);
    double s04 = static_cast<double>(down1);
    double s05 = static_cast<double>(down);

    ctrlState.a2b2 = s01 + s03;
    ctrlState.c2d2 = s01 + s02 + s03;
    ctrlState.e2f2 = s01 + s02;
    ctrlState.i2g2 = s03 + s04 + s05;
    ctrlState.j2k2 = s04 + s05;

}
