//------------------------------------------------------------------------------
//
//
//
//
//------------------------------------------------------------------------------
#ifndef     POWER_LINE_ELEMENT_H
#define     POWER_LINE_ELEMENT_H

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
enum
{
    DC_CURRENT = 0,
    AC_CURRENT = 1,
    NOT_DEFINED_CURRENT = -1
};

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
struct power_line_element_t
{
    /// Ж/д координата (ордината)
    float          railway_coord;
    /// Напряжение КС
    float          voltage;
    /// Род тока КС (0 - постоянный, 1 - переменный, -1 - не определено)
    int             current_kind;

    power_line_element_t()
        : railway_coord(0.0)
        , voltage(0.0)
        , current_kind(NOT_DEFINED_CURRENT)
    {

    }
};

#endif // POWER_LINE_ELEMENT_H
