#ifndef     SIGNAL_TYPES_H
#define     SIGNAL_TYPES_H

#include    <array>

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
enum
{
    NUM_LENS = 8,

    RED_LENS = 0,           ///< Красный огонь светофора
    YELLOW_LENS = 1,        ///< Жёлтый огонь светофора
    GREEN_LENS = 2,         ///< Зелёный огонь светофора
    BOTTOM_YELLOW_LENS = 3, ///< Нижний жёлтый огонь светофора
    WHITE_LENS = 4,         ///< Белый огонь светофора
    BLUE_LENS = 5,          ///< Синий огонь светофора
    THIRD_YELLOW_LENS = 5,  ///< Третий жёлтый огонь светофора
    GREEN_LINE = 6,         ///< Сигнальная зелёная полоса
    GREEN_LINE_2 = 7,       ///< Вторая сигнальная зелёная полоса
};

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
using lens_state_t = std::array<bool, NUM_LENS>;

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
enum
{
    NUM_ALSN_CTRL_LINES = 3,
    ALSN_RY_LINE = 0,
    ALSN_Y_LINE = 1,
    ALSN_G_LINE = 2
};

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
using alsn_state_t = std::array<bool, NUM_ALSN_CTRL_LINES>;

#endif
