#ifndef     SIGNAL_TYPES_H
#define     SIGNAL_TYPES_H

#include    <array>

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
enum
{
    RED_LENS,           ///< Красный огонь светофора
    YELLOW_LENS,        ///< Жёлтый огонь светофора
    GREEN_LENS,         ///< Зелёный огонь светофора
    BOTTOM_YELLOW_LENS, ///< Нижний жёлтый огонь светофора
    WHITE_LENS,         ///< Белый огонь светофора
    BLUE_LENS,          ///< Синий огонь светофора
    THIRD_YELLOW_LENS,  ///< Третий жёлтый огонь светофора
    GREEN_LINE,         ///< Сигнальная зелёная полоса
    GREEN_LINE_2,       ///< Вторая сигнальная зелёная полоса

    NUM_LENS
};

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
using lens_state_t = std::array<bool, NUM_LENS>;

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
enum
{    
    ALSN_RY_LINE,
    ALSN_Y_LINE,
    ALSN_G_LINE,

    NUM_ALSN_CTRL_LINES
};

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
using alsn_state_t = std::array<bool, NUM_ALSN_CTRL_LINES>;

#endif
