#ifndef TOPOLOGY_DEFINES_H
#define TOPOLOGY_DEFINES_H

#include <cstdint>

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
enum Direction_t : std::int8_t
{
    SW_BWD_PLUS = 0,   ///< Направление от стрелки сзади прямо
    SW_FWD_PLUS = 1,   ///< Направление от стрелки спереди прямо
    SW_BWD_MINUS = 2,  ///< Направление от стрелки сзади на отклонение
    SW_FWD_MINUS = 3,  ///< Направление от стрелки спереди на отклонение
    SW_DIRECTION_UNKNOWN = -1
};
enum : std::int8_t { SW_DIRECTIONS_NUM = SW_FWD_MINUS + 1 }; ///< Количество вариантов направлений

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
enum Orientation_t : std::int8_t
{
    TRAJ_NORMAL = 1,     ///< Ориентация траектории совпадает с ориентацией стрелки
    TRAJ_REVERSED = -1,  ///< Ориентация траектории противоположна ориентации стрелки
    TRAJ_ORIENTATION_UNKNOWN = 0
};

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
enum Switch_state_t : std::int8_t
{
    ONLY_MINUS = -1,        ///< Единственная траектория в минусовом направлении
    ONLY_PLUS = 1,          ///< Единственная траектория в плюсовом направлении
    STATE_MINUS = -2,       ///< Стрелка в минусовом положении (на отклонение)
    STATE_PLUS = 2,         ///< Стрелка в плюсовом положении (прямо)
    IS_BUSY_MINUS = -3,     ///< Стрелка занята ПЕ в минусовом положении
    IS_BUSY_PLUS = 3,       ///< Стрелка занята ПЕ в плюсовом положении
    IN_ROUTE_MINUS = -4,    ///< Стрелка в маршруте в минусовом положении
    IN_ROUTE_PLUS = 4,      ///< Стрелка в маршруте в плюсовом положении
    NO_POSSIBLE_DIRECTION = 0   ///< Нет возможных траекторий
};

#endif // TOPOLOGY_DEFINES_H
