#ifndef     VL60_CONTROLS_H
#define     VL60_CONTROLS_H

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
enum
{
    CTRL_TUMBLER_PNT = 100,         ///< Токоприёмники (общий)
    CTRL_TUMBLER_PNT1 = 101,        ///< Токоприёмник передний
    CTRL_TUMBLER_PNT2 = 102,        ///< Токоприёмник задний
    CTRL_TUMBLER_CU = 103,          ///< Цепи управления
    CTRL_TUMBLER_GV = 104,          ///< Главный выключатель
    CTRL_TUMBLER_GV_RETURN = 105,   ///< Возврат защиты ГВ (кнопка)
    CTRL_TUMBLER_FR = 106,          ///< Фазорасщепитель
    CTRL_TUMBLER_MK = 107,          ///< Мотор-компрессор
    CTRL_TUMBLER_MV1 = 108,         ///< Мотор-вентилятор 1
    CTRL_TUMBLER_MV2 = 109,         ///< Мотор-вентилятор 2
    CTRL_TUMBLER_MV3 = 110,         ///< Мотор-вентилятор 3
    CTRL_TUMBLER_MV4 = 111,         ///< Мотор-вентилятор 4
    CTRL_TUMBLER_MV5 = 112,         ///< Мотор-вентилятор 5
    CTRL_TUMBLER_MV6 = 113,         ///< Мотор-вентилятор 6
    CTRL_TUMBLER_EPT = 114,         ///< ЭПТ
    CTRL_TUMBLER_CAB_LIGHT_LOW = 115,   ///< Освещение кабины тусклое
    CTRL_TUMBLER_CAB_LIGHT_HIGH = 116,  ///< Освещение кабины яркое
    CTRL_TUMBLER_LIGHT_DEVICES = 117,   ///< Освещение приборов
    CTRL_TUMBLER_BUFFLIGHT_L = 118,     ///< Буферный фонарь левый
    CTRL_TUMBLER_BUFFLIGHT_R = 119,     ///< Буферный фонарь правый
    CTRL_TUMBLER_BUFFCOLOR_L = 120,     ///< Буферный фонарь слева: белый/красный
    CTRL_TUMBLER_BUFFCOLOR_R = 121,     ///< Буферный фонарь справа: белый/красный
    CTRL_CRANE_395 = 130,           ///< Кран машиниста 395: позиция I..VI (0..6)
    CTRL_CRANE_254 = 131,           ///< Кран вспомогательный 254: положение
    CTRL_KM_MAIN = 132,             ///< КМЭ главная рукоятка: позиция 0..33
    CTRL_KM_REVERS = 133,           ///< КМЭ реверс: 0 - назад, 1 - ноль, 2 - вперёд
    CTRL_KM_REVERS_INSERT = 134,    ///< КМЭ реверсивная рукоятка: вставить/извлечь
    CTRL_LOCK_367 = 135,            ///< УБТ-367: поворот ключа
    CTRL_CRANE_COMBINE = 136        ///< Комбинированный кран: -1..+1
};

#endif
