#include    <io-controller.h>
#include    <io-controller-keymap.h>
#include    <CfgReader.h>

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
IOController::IOController(QObject *parent) : QObject(parent)
{

}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void IOController::setPressedKey(uint16_t keyBase)
{
    if (KeySymbolsRRS.count(keyBase))
    {
        auto result = _pressed_keys.insert(keyBase);
        if (result.second)
        {
            processControl(CTRL_TYPE_KEYBOARD);
        }
    }
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void IOController::setReleasedKey(uint16_t keyBase)
{
    if (_pressed_keys.erase(keyBase))
    {
        processControl(CTRL_TYPE_KEYBOARD);
    }
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void IOController::step(float t, float dt)
{

}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
bool IOController::load_config(CfgReader &cfg)
{
    return true;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void IOController::processKeyBoardInput()
{
    // Уходим, если ничего не нажато
    if (_pressed_keys.empty())
    {
        return;
    }
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void IOController::processMouseInput()
{

}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void IOController::processControlPanelInput()
{

}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void IOController::processControl(const ControlType &ctrl_type)
{
    // В зависиомсти от типа обрабатываемого управления, вызываем тот или иной
    // метод обработки, видоизменяющий специфичные для данной ПЕ состяния органов управления.
    // Вызывается один какой-то метода, в зависиомсти от того, откуда пришел
    // управляющий сигнал
    switch (ctrl_type)
    {
    case CTRL_TYPE_KEYBOARD:

        processKeyBoardInput();

        break;

    case CTRL_TYPE_MOUSE:

        processMouseInput();

        break;

    case CTRL_TYPE_CTRL_PANEL:

        processControlPanelInput();

        break;
    }
}
