#ifndef     COUPLING_DATA_H
#define     COUPLING_DATA_H

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
enum
{
    COUPL_SIZE_OF_OUTPUTS = 3,      ///< Размер массива исходящих сигналов

    COUPL_OUTPUT_REF_STATE = 0,     ///< Управление сцепкой: 1.0 - соединить, -1.0 - разъединить, 0.0 - оставить текущее состояние
    COUPL_OUTPUT_COORD = 1,         ///< Координата положения сцепки на треке пути
    COUPL_OUTPUT_VELOCITY = 2,      ///< Скорость движения сцепки на треке пути

    COUPL_SIZE_OF_INPUTS = 2,       ///< Размер массива входящих сигналов

    COUPL_INPUT_IS_CONNECTED = 0,   ///< Состояние сцепок: 1.0 - соединены, 0.0 - разъединены
    COUPL_INPUT_FORCE = 1           ///< Тяговое усилие на сцепке
};

#endif // COUPLING_DATA_H
