#include    "ept-control-line.h"

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
EPTControlLine::EPTControlLine(QObject *parent) : Device(parent)
  , U_in(0)
  , U_out(0)
  , L(0.01)
  , r(0.1)
  , I_out(0)
  , G(0)
{
    u.resize(2);
    R.resize(2);

    // Состояние вентилей - закрыты
    std::fill(u.begin(), u.end(), 0);
    // Активное сопротивление - велико
    std::fill(R.begin(), R.end(), 1e6);
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
EPTControlLine::~EPTControlLine()
{

}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void EPTControlLine::setValvesNumber(size_t num)
{
    u.resize(num);
    R.resize(num);

    // Состояние вентилей - закрыты
    std::fill(u.begin(), u.end(), 0);
    // Активное сопротивление - велико
    std::fill(R.begin(), R.end(), 1e6);
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void EPTControlLine::preStep(state_vector_t &Y, double t)
{
    // Считаем эквивалентную проводимость вентилей, в зависимости от их состояния
    G = 0.1;
    for (size_t i = 0; i < R.size(); ++i)
    {
        G += u[i] / R[i];
    }

    // Считаем величину выходного напряжения
    U_out = (Y[0] - I_out) / G;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void EPTControlLine::ode_system(const state_vector_t &Y,
                                state_vector_t &dYdt,
                                double t)
{
    dYdt[0] = ( U_in - Y[0] * (1.0 / G + r) + I_out / G ) / L;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void EPTControlLine::load_config(CfgReader &cfg)
{
    QString secName = "Device";

    for (size_t i = 0; i < R.size(); ++i)
    {
        cfg.getDouble(secName, QString("R%1").arg(i), R[i]);
    }

    cfg.getDouble(secName, "r", r);
    cfg.getDouble(secName, "L", L);
}
