#include    "pneumo-switching-valve.h"

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
SwitchingValve::SwitchingValve(double working_volume_1,
                               double working_volume_2,
                               QObject *parent)
    : BrakeDevice(parent)
    , V1(working_volume_1)
    , V2(working_volume_2)
    , pOUT(0.0)
    , QIN1(0.0)
    , QIN2(0.0)
    , QOUT(0.0)
    , K1(0.05)
    , A1(1.0)
{

}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
SwitchingValve::~SwitchingValve()
{

}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void SwitchingValve::setInputFlow1(double value)
{
    QIN1 = value;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
double SwitchingValve::getPressure1() const
{
    return getY(1);
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void SwitchingValve::setInputFlow2(double value)
{
    QIN2 = value;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
double SwitchingValve::getPressure2() const
{
    return getY(2);
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void SwitchingValve::setOutputPressure(double value)
{
    pOUT = value;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
double SwitchingValve::getOutputFlow() const
{
    return QOUT;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void SwitchingValve::ode_system(const state_vector_t &Y,
                                state_vector_t &dYdt,
                                double t)
{
    Q_UNUSED(t)

    // Перемещение клапана
    double v = A1 * (Y[1] - Y[2]);

    double u1 = pf(Y[0]);

    double u2 = nf(Y[0]);

    // Исходящий поток из первой камеры
    double Q1 = K1 * (Y[1] - pOUT) * u1;

    // Исходящий поток из второй камеры
    double Q2 = K1 * (Y[2] - pOUT) * u2;

    QOUT = Q1 + Q2;

    dYdt[0] = v;

    dYdt[1] = (QIN1 - Q1) / V1;

    dYdt[2] = (QIN2 - Q2) / V2;

}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void SwitchingValve::preStep(state_vector_t &Y, double t)
{
    Q_UNUSED(t)
    Q_UNUSED(Y)

    Y[0] = cut(Y[0], -1.0, 1.0);
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void SwitchingValve::load_config(CfgReader &cfg)
{
    QString secName = "Device";

    double tmp1 = 0.0;
    cfg.getDouble(secName, "V1", tmp1);
    if (tmp1 > 1e-3)
        V1 = tmp1;

    double tmp2 = 0.0;
    cfg.getDouble(secName, "V2", tmp2);
    if (tmp2 > 1e-3)
        V2 = tmp2;

    cfg.getDouble(secName, "K1", K1);
    cfg.getDouble(secName, "A1", A1);
}
