#include    "pneumo-anglecock.h"

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
PneumoAngleCock::PneumoAngleCock(QObject *parent) : BrakeDevice(parent)
  , p_pipe(0.0)
  , p_hose(0.0)
  , Q_pipe(0.0)
  , Q_hose(0.0)
  , k(0.1)
  , k_atm(0.02)
  , is_opened(true)
{

}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
PneumoAngleCock::~PneumoAngleCock()
{

}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void PneumoAngleCock::setP_pipe(double p)
{
    this->p_pipe = p;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void PneumoAngleCock::setP_hose(double p)
{
    this->p_hose = p;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void PneumoAngleCock::setState(bool opened)
{
    this->is_opened = opened;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void PneumoAngleCock::changeState()
{
    this->is_opened = !(this->is_opened);
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
double PneumoAngleCock::getQ_pipe() const
{
    return Q_pipe;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
double PneumoAngleCock::getQ_hose() const
{
    return Q_hose;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
bool PneumoAngleCock::getState() const
{
    return is_opened;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void PneumoAngleCock::preStep(state_vector_t &Y, double t)
{
    Q_UNUSED(Y)
    Q_UNUSED(t)

    if (is_opened)
    // Открытый концевой кран
    {
        // Рукав соединён с магистралью
        double Q = k * (p_hose - p_pipe);
        Q_pipe = Q;
        Q_hose = -Q;
    }
    else
    // Закрытый концевой кран
    {
        // Магистраль перекрыта
        Q_pipe = 0.0;
        // Рукав соединён с атмосферой
        Q_hose = -k_atm * p_hose;
    }
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void PneumoAngleCock::ode_system(const state_vector_t &Y,
                                state_vector_t &dYdt,
                                double t)
{
    Q_UNUSED(Y)
    Q_UNUSED(dYdt)
    Q_UNUSED(t)
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void PneumoAngleCock::load_config(CfgReader &cfg)
{
    QString secName = "Device";

    cfg.getDouble(secName, "k", k);
    cfg.getDouble(secName, "kAtm", k_atm);
    cfg.getBool(secName, "isStateOpened", is_opened);
}
