#include    "pneumo-relay.h"

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
PneumoRelay::PneumoRelay(double work_volume, QObject *parent) : BrakeDevice(parent)
  , V0(work_volume)
  , pCONTROL(0.0)
  , pFL(0.0)
  , pPIPE(0.0)
  , QCONTROL(0.0)
  , QFL(0.0)
  , QPIPE(0.0)
  , eps(0.001)
  , A1(5.0)
  , K1(1.0e-2)
  , K2(2.0e-2)
{

}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
PneumoRelay::~PneumoRelay()
{

}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void PneumoRelay::setControlPressure(double value)
{
    pCONTROL = value;
    is_set_pressure = true;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void PneumoRelay::setControlFlow(double value)
{
    QCONTROL = value;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
double PneumoRelay::getControlPressure() const
{
    return getY(0);
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void PneumoRelay::setFLpressure(double value)
{
    pFL = value;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
double PneumoRelay::getFLflow() const
{
    return QFL;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void PneumoRelay::setPipePressure(double value)
{
    pPIPE = value;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
double PneumoRelay::getPipeFlow() const
{
    return QPIPE;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void PneumoRelay::ode_system(const state_vector_t &Y,
                             state_vector_t &dYdt,
                             double t)
{
    Q_UNUSED(Y)
    Q_UNUSED(t)

    // Проверям, задавалось ли давление в камере напрямую
    if (is_set_pressure)
    {
        setY(0, pCONTROL);
        QCONTROL = 0.0;
    }

    is_set_pressure = false;
    dYdt[0] = QCONTROL / V0;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void PneumoRelay::preStep(state_vector_t &Y, double t)
{
    Q_UNUSED(t)

    // Условное положение диафрагмы управляющей камеры
    double s1 = A1 * dead_zone(Y[0] - pPIPE, -eps, eps);

    // Поток из питательной магистрали в управляемую
    double Q_fl_pipe = cut(s1, 0.0, K1) * (pFL - pPIPE);

    // Разрядка управляемой магистрали в атмосферу
    double Q_pipe_atm = cut(-s1, 0.0, K2) * pPIPE;

    // Поток в питательную магистраль
    QFL = - Q_fl_pipe;

    // Поток в управляемую магистраль
    QPIPE = Q_fl_pipe - Q_pipe_atm;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void PneumoRelay::load_config(CfgReader &cfg)
{
    QString secName = "Device";

    double tmp = 0.0;
    cfg.getDouble(secName, "V0", tmp);
    if (tmp > 1e-3)
        V0 = tmp;

    cfg.getDouble(secName, "eps", eps);
    cfg.getDouble(secName, "A1", A1);
    cfg.getDouble(secName, "K1", K1);
    cfg.getDouble(secName, "K2", K2);
}
