#include    "train-horn.h"

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
TrainHorn::TrainHorn(QObject *parent) : Device(parent)
    , svistok_state(sound_state_t())
    , tifon_state(sound_state_t())
    , pFL(0.0)
    , QFL(0.0)
    , p_nom(0.9)
    , k_svistok(5.0e-4)
    , k_tifon(8.0e-4)
{

}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
TrainHorn::~TrainHorn()
{

}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void TrainHorn::step(double t, double dt)
{
    // Переопределяем шаг, поскольку выполнение решателя не нужно
    // Нужна только обработка клавиатурного ввода
    stepKeysControl(t, dt);
    stepExternalControl(t, dt);

    // Расчёт коэффициента расхода воздуха в атмосферу при работе звуковых сигналов
    double k = 0.0;
    // Расчёт громкости звуковых сигналов
    float volume_level = cut(static_cast<float>(pFL / p_nom), 0.0f, 1.0f);
    svistok_state.volume = volume_level;
    tifon_state.volume = volume_level;

    if (svistok_state.play)
    {
        k += k_svistok;
    }
    if (tifon_state.play)
    {
        k += k_tifon;
    }

    // Расход воздуха питательной магистрали
    QFL = -k * pFL;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void TrainHorn::setSvistokOn(bool state)
{
    svistok_state.play = state;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
bool TrainHorn::isSvistok() const
{
    return svistok_state.play;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
sound_state_t TrainHorn::getSvistokSound() const
{
    return svistok_state;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void TrainHorn::setTifonOn(bool state)
{
    tifon_state.play = state;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
bool TrainHorn::isTifon() const
{
    return tifon_state.play;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
sound_state_t TrainHorn::getTifonSound() const
{
    return tifon_state;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void TrainHorn::setFLpressure(double value)
{
    pFL = value;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
double TrainHorn::getFLflow() const
{
    return QFL;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void TrainHorn::ode_system(const state_vector_t &Y,
                           state_vector_t &dYdt,
                           double t)
{
    Q_UNUSED(Y)
    Q_UNUSED(dYdt)
    Q_UNUSED(t)
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void TrainHorn::load_config(CfgReader &cfg)
{
    QString secName = "Device";

    double tmp = 0.0;
    cfg.getDouble(secName, "p_nom", tmp);
    if (tmp > Physics::ZERO)
        p_nom = tmp;

    cfg.getDouble(secName, "k_svistok", k_svistok);
    cfg.getDouble(secName, "k_tifon", k_tifon);
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void TrainHorn::stepKeysControl(double t, double dt)
{
    Q_UNUSED(t)
    Q_UNUSED(dt)

    setSvistokOn(getKeyState(KEY_Space));
    setTifonOn(getKeyState(KEY_B));
}
