#include    "passcar.h"
#include    "filesystem.h"

#include    <QDir>

//------------------------------------------------------------------------------
// Инициализация звуков, воспроизведение их на нулевой громкости
//------------------------------------------------------------------------------
void PassCarrige::initSounds()
{
    emit soundPlay("Pass_5_10");
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void PassCarrige::soundStep()
{
    if (velocity * 3.6 > 5) {
        emit soundSetVolume("Pass_5_10", 100);
    } else {
        emit soundSetVolume("Pass_5_10", 0);
    }
}
